snlkuharlocal/src/Documents/ЗаказИМ/ЗаказИМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказИМ</name>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаказаИМ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИнетЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛогистЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАвизации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>EnumRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДоставки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКомиссииДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратИМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Выкуп</name>
    <type>
      <types>DocumentRef.ВыкупИМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплата</name>
    <type>
      <types>DocumentRef.ОплатаИМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияОплачена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВыкупа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказаОбщая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодтвержденныйЗаказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КачествоТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВозврат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоЗаказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Скидка %</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковокВозврат</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Возвраты</name>
    <attributes>
      <name>Возврат</name>
      <type>
        <types>DocumentRef.Возврат1ИМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СтатусЗаказаИМ/СтатусЗаказаИМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаказаИМ</name>
  <enumValues>
    <name>Формирование</name>
  </enumValues>
  <enumValues>
    <name>ПодготовкаКВыдаче</name>
  </enumValues>
  <enumValues>
    <name>ГотовоКВыдаче</name>
  </enumValues>
  <enumValues>
    <name>ПереданоВДоставку</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>СформированыДокументы</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаОплата</name>
  </enumValues>
  <enumValues>
    <name>ОтказКлиента</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаказИМ/Forms/ФормаДокумента/Module.bsl
//МСА 050626 ремарю пока считая что миграция только снизу вверх
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	// Вставить содержимое обработчика. 
	//Если Событие = "Штрихкод" Тогда
	//	// если форма неактивна, то ввод не производим
	//	Если Не ЭтаФорма.ВводДоступен() Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Если НЕ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПодготовкаКВыдаче")
	//	И НЕ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Обработка") Тогда
	//		ПоказатьПредупреждение(, "Сканирование КМ только в статусах 'Подготовка к выдаче' и 'Обработка'");
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Если СтрДлина(СокрЛП(Данные)) > 30 и СтрНайти(Лев(СокрЛП(Данные),3),"01") > 0 Тогда //Отсканирована Марка
	//		ШтрихКодУпаковки = ПолучитьСсылкуШКУпаковки(Данные);
	//		Если ЗначениеЗаполнено(ШтрихКодУпаковки) Тогда
	//			ПоказатьПредупреждение(, ОбработатьСтрТов(ШтрихКодУпаковки), 30);			
	//		Иначе
	//			ОпНеНайденКИЗ(Данные, "Сосканирована марка ЧЗ, но в справочнике штрихкодов упаковки не найдена  ");
	//		КонецЕсли;
	//	Иначе
	//		ПоказатьПредупреждение(, "Предусмотрено только сканирование КМ", 30);
	//		//СтрокаТЧ = РаботаСЭлементамиФормыКлиент.ОбработкаШтрихкода(ЭтаФорма, Данные, Ложь);
	//	КонецЕсли;
	//	//-HELP-8926 20260327 Михайловский
	//КонецЕсли;
	ПоказатьКолво();	
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапросСтатусШКУпаковки(СсылкаШКУпаковки)
	Рез = Новый Структура; 
	Рез.Вставить("НачСтатус", Неопределено);
	//Рез.Вставить("Номенклатура", Неопределено);
	Рез.Вставить("ТекСтатус", Неопределено);
	Рез.Вставить("ХКМПриход", Неопределено);
	Рез.Вставить("Приход", Неопределено);
	Рез.Вставить("ХКМТек", Неопределено);
	Рез.Вставить("ТекДок", Неопределено); 
	Рез.Вставить("МожноВ", Ложь);
	Рез.Вставить("СобШК", Ложь);
	//Запрос = Новый Запрос;
	//Запрос.Текст =  
	//"ВЫБРАТЬ
	//|	СтатусыКМ_Факт.Статус КАК Статус,
	//|	СтатусыКМ_Факт.Регистратор КАК Регистратор,
	//|	СтатусыКМ_Факт.Местонахождение КАК Местонахождение,
	//|	СтатусыКМ_Факт.ШтрихКодУпаковки.ЭтоЧужойШК КАК ЭтоЧужойШК
	//|ИЗ
	//|	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
	//|ГДЕ
	//|	СтатусыКМ_Факт.ШтрихКодУпаковки = &ШтрихКодУпаковки
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	СтатусыКМ_Факт.Период,
	//|	СтатусыКМ_Факт.Регистратор.Дата";
	//Запрос.УстановитьПараметр("ШтрихКодУпаковки",СсылкаШКУпаковки);
	//Результат = запрос.Выполнить().Выбрать();
	//к = 0;
	//Пока Результат.Следующий() Цикл
	//	Если к = 0 Тогда
	//		Рез.НачСтатус = Результат.Статус;
	//		Если Результат.ЭтоЧужойШК = Истина Тогда
	//			Рез.СобШК = Истина;
	//		КонецЕсли;	
	//		//Рез.Номенклатура = Результат.Номенклатура; 
	//		Если ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда
	//			Рез.ХКМПриход = Результат.Регистратор; 
	//			Рез.Приход = Результат.Регистратор.ДокОснование;
	//		Иначе
	//			Рез.Приход = Результат.Регистратор;
	//		КонецЕсли;	
	//	КонецЕсли;
	//	Рез.ТекСтатус = Результат.Статус;
	//	
	//	Если ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда
	//		Рез.ХКМТек = Результат.Регистратор; 
	//		Рез.ТекДок = Результат.Регистратор.ДокОснование;
	//	Иначе
	//		Рез.ТекДок = Результат.Регистратор;
	//	КонецЕсли;
	//	
	//	к = к + 1;
	//КонецЦикла; 
	//Если (Рез.ТекСтатус = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте ИЛИ Рез.ТекСтатус = Перечисления.СтатусыКодовМаркировкиФакт.Карантин) Тогда
	//	Рез.МожноВ = Истина;
	//КонецЕсли;	
	Возврат Рез;
	
КонецФункции

&НаСервере
Функция ОбработатьСтрТов(ШтрихКодУпаковки)
	Рез = "";
	//
	//рШапки = ОбщегоНазначения_Инт.ПолучитьРеквизитыШапки(ШтрихКодУпаковки, "Владелец Характеристика,Владелец.Владелец Номенклатура");  
	//Если НЕ ЗначениеЗаполнено(рШапки.Номенклатура) Тогда
	//	Возврат "Отмена, не найдена номенклатура по КМ";
	//КонецЕсли;
	//
	//СтатКМ = ЗапросСтатусШКУпаковки(ШтрихКодУпаковки);
	//Если СтатКМ.СобШК = Истина Тогда
	//	Возврат "Отмена, внутренняя маркировка КМ " + Строка(ШтрихКодУпаковки);
	//КонецЕсли;
	//Если Объект.Статус = Перечисления.СтатусЗаказаИМ.ПодготовкаКВыдаче Тогда
	//	Если СтатКМ.МожноВ = Ложь Тогда
	//		Возврат "Отмена, тек. статус " + Строка(СтатКМ.ТекСтатус);
	//	КонецЕсли; 
	//	
	//	НомДрЗИМ = ЕстьВДрЗИМ(ШтрихКодУпаковки, Объект.Ссылка);
	//	Если НЕ ПустаяСтрока(НомДрЗИМ) Тогда
	//		Возврат "Сосканированая марка ЧЗ уже есть в др. ЗИМ № " + НомДрЗИМ;
	//	КонецЕсли;
	//КонецЕсли;
	//НайдыЧЗ = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", ШтрихКодУпаковки));
	//Если НайдыЧЗ.Количество() Тогда
	//	Если Объект.Статус = Перечисления.СтатусЗаказаИМ.ПодготовкаКВыдаче Тогда
	//		Возврат "Сосканированая марка ЧЗ уже есть в заявке ";
	//	Иначе
	//		//СтрокаШтрихКодаУпаковкиВ = Объект.ШтрихкодыУпаковокВозврат.Добавить();
	//		//СтрокаШтрихКодаУпаковкиВ.ШтрихкодУпаковки 	= ШтрихКодУпаковки;			 
	//		//СтрокаШтрихКодаУпаковкиВ.ХарактеристикаНоменклатуры		= рШапки.Характеристика;
	//		//СтрокаШтрихКодаУпаковкиВ.Номенклатура 		= рШапки.Номенклатура;
	//		НайдыЧЗВ = Объект.ШтрихкодыУпаковокВозврат.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", ШтрихКодУпаковки));
	//		Если НайдыЧЗВ.Количество() Тогда
	//			Возврат "Отмена, КМ уже есть в возврате";
	//		Иначе	
	//			НайдыТ = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", рШапки.Номенклатура, рШапки.Характеристика));
	//			Если НайдыТ.Количество() = 0 Тогда
	//				Возврат "Отмена, не найдена позиция в товарах для возврата";
	//			Иначе
	//				НайдТ = НайдыТ[0];
	//				Если НайдТ.Количество > 0 Тогда
	//					
	//					НайдТ.Количество = НайдТ.Количество - 1;
	//					НайдТ.КоличествоВозврат = НайдТ.КоличествоВозврат + 1;
	//					НайдТ.Всего = НайдТ.Цена * НайдТ.Количество;
	//					ПроцНДС = Перечисления.СтавкиНДС.ПроцентНДС(НайдТ.СтавкаНДС);
	//					Всего = НайдТ.Всего;
	//					НайдТ.НДС = Окр(ПроцНДС * Всего/(100 + ПроцНДС), 2);
	//					НайдТ.Сумма	= Всего - НайдТ.НДС;
	//					
	//					СтрокаШтрихКодаУпаковкиВ = Объект.ШтрихкодыУпаковокВозврат.Добавить();
	//					СтрокаШтрихКодаУпаковкиВ.ШтрихкодУпаковки 	= ШтрихКодУпаковки;			 
	//					СтрокаШтрихКодаУпаковкиВ.ХарактеристикаНоменклатуры		= рШапки.Характеристика;
	//					СтрокаШтрихКодаУпаковкиВ.Номенклатура 		= рШапки.Номенклатура;
	//					Рез = "Добавлено ном. " + Строка(СтрокаШтрихКодаУпаковкиВ.Номенклатура) + ", хар. " + Строка(СтрокаШтрихКодаУпаковкиВ.ХарактеристикаНоменклатуры);
	//				Иначе
	//					Возврат "Отмена, превышение по количеству в заказе";
	//				КонецЕсли;	
	//				
	//			КонецЕсли;
	//		КонецЕсли;	
	//	КонецЕсли;	
	//Иначе
	//	Если Объект.Статус = Перечисления.СтатусЗаказаИМ.ПодготовкаКВыдаче Тогда
	//		НайдыТ = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", рШапки.Номенклатура, рШапки.Характеристика));
	//		Если НайдыТ.Количество() = 0 Тогда
	//			Возврат "Отмена, не найдена позиция в товарах";
	//		Иначе
	//			НайдТ = НайдыТ[0];
	//			Если НайдТ.ПодтвержденныйЗаказ < НайдТ.Заказ Тогда
	//				НайдТ.ПодтвержденныйЗаказ = НайдТ.ПодтвержденныйЗаказ + 1;
	//				НайдТ.Количество = НайдТ.ПодтвержденныйЗаказ;

	//				НайдТ.Всего = НайдТ.Цена * НайдТ.ПодтвержденныйЗаказ;
	//				ПроцНДС = Перечисления.СтавкиНДС.ПроцентНДС(НайдТ.СтавкаНДС);
	//				Всего = НайдТ.Всего;
	//				НайдТ.НДС = Окр(ПроцНДС * Всего/(100 + ПроцНДС), 2);
	//				НайдТ.Сумма	= Всего - НайдТ.НДС;

	//				СтрокаШтрихКодаУпаковки = Объект.ШтрихкодыУпаковок.Добавить();
	//				СтрокаШтрихКодаУпаковки.ШтрихкодУпаковки 	= ШтрихКодУпаковки;			 
	//				СтрокаШтрихКодаУпаковки.ХарактеристикаНоменклатуры		= рШапки.Характеристика;
	//				СтрокаШтрихКодаУпаковки.Номенклатура 		= рШапки.Номенклатура;
	//				Рез = "Добавлено ном. " + Строка(СтрокаШтрихКодаУпаковки.Номенклатура) + ", хар. " + Строка(СтрокаШтрихКодаУпаковки.ХарактеристикаНоменклатуры);
	//			Иначе
	//				Возврат "Отмена, превышение по количеству в заказе";
	//			КонецЕсли;	
	//			
	//		КонецЕсли;
	//	Иначе
	//		Возврат "Сосканированая марка ЧЗ отсутствует в заказе ";
	//	КонецЕсли;	
	//КонецЕсли; 

	Возврат Рез;
КонецФункции
 
//&НаКлиенте
//Функция ПолучитьСсылкуШКУпаковки(ШтрихКод) 
//	
//	Если Найти(ШтрихКод, МаркировкаКлиентСервер.РазделительGS1()) > 0 Тогда  
//		ШтрихКод = СтрЗаменить(ШтрихКод, МаркировкаКлиентСервер.РазделительGS1(),"<GS>");
//		ШтрихКод = ?(Лев(ШтрихКод, 4) = "<GS>", Сред(ШтрихКод, 5), ШтрихКод);
//		SGTIN = Лев(ШтрихКод, СтрНайти(ШтрихКод,"<GS>")-1);
//	ИначеЕсли Найти(ШтрихКод, "<GS>") > 0 Тогда
//		ШтрихКод = ?(Лев(ШтрихКод, 4) = "<GS>", Сред(ШтрихКод, 5), ШтрихКод);
//		SGTIN = Лев(ШтрихКод, СтрНайти(ШтрихКод,"<GS>")-1);
//	ИначеЕсли СтрДлина(СокрЛП(ШтрихКод)) > 30 и СтрНайти(Лев(СокрЛП(ШтрихКод),3),"01") > 0 Тогда //Отсканирована Марка но в формате ХЗ
//		SGTIN = Лев(ШтрихКод, 31);
//	КонецЕсли; 
//	СсылкаШКУпаковок = ЗапросШКУпаковки(SGTIN);
//	Возврат СсылкаШКУпаковок;		
//КонецФункции

//&НаСервереБезКонтекста
//Функция ЗапросШКУпаковки(SGTIN)
//	Запрос = Новый Запрос;
//	Запрос.Текст =  
//	"ВЫБРАТЬ
//	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
//	|ГДЕ
//	|	ШтрихкодыУпаковокТоваров.Наименование = &SGTIN" ;
//	Запрос.УстановитьПараметр("SGTIN",SGTIN);
//	Результат = Запрос.Выполнить().Выбрать();
//	
//	СсылкаШКУпаковки = Неопределено;
//	Если Результат.Следующий() Тогда
//		СсылкаШКУпаковки = Результат.Ссылка;
//	КонецЕсли;
//	Возврат СсылкаШКУпаковки;

//КонецФункции //-HELP-8926 20260327 Михайловский

//&НаКлиенте
//Процедура ОпНеНайденКИЗ(ШК, Сооб = "Сосканирована марка ЧЗ, но в справочнике штрихкодов упаковки не найдена  ")
//	Если Найти(ШК, МаркировкаКлиентСервер.РазделительGS1()) > 0 Тогда  //Марка с GS
//		
//		Марка = СтрЗаменить(ШК, МаркировкаКлиентСервер.РазделительGS1(),"<GS>");
//		Марка = ?(Лев(Марка, 4) = "<GS>", Сред(Марка, 5), Марка);	
//		
//	ИначеЕсли Найти(ШК, "<GS>") > 0 Тогда //сканируем с экрана
//		Марка = ШК;
//		Марка = ?(Лев(Марка, 4) = "<GS>", Сред(Марка, 5), Марка);
//	ИначеЕсли СтрДлина(СокрЛП(ШК)) > 30 и СтрНайти(Лев(СокрЛП(ШК),3),"01") > 0 Тогда
//		Марка = СокрЛП(ШК); 
//	КонецЕсли;
//	ПоказатьПредупреждение(, Сооб + Марка, 30);
//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ЕстьВДрЗИМ(ШКУ, ЗИМСсыл)
//	Рез = "";   
//	Запр = Новый Запрос;
//	Запр.Текст = 
//	"ВЫБРАТЬ
//	|	ЗаказИМШтрихкодыУпаковок.Ссылка.Номер КАК Номер,
//	|	ЗаказИМШтрихкодыУпаковок.НомерСтроки КАК НомерСтроки
//	|ИЗ
//	|	Документ.ЗаказИМ.ШтрихкодыУпаковок КАК ЗаказИМШтрихкодыУпаковок,
//	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказИМ.ШтрихкодыУпаковокВозврат КАК ЗаказИМШтрихкодыУпаковокВозврат
//	|	ПО ЗаказИМШтрихкодыУпаковок.ШтрихкодУпаковки = ЗаказИМШтрихкодыУпаковокВозврат.ШтрихкодУпаковки
//	|	И НЕ ЗаказИМШтрихкодыУпаковокВозврат.Ссылка = &ЗИМСсыл
//	|ГДЕ
//	|	НЕ ЗаказИМШтрихкодыУпаковок.Ссылка = &ЗИМСсыл
//	|	И ЗаказИМШтрихкодыУпаковок.ШтрихкодУпаковки = &ШКУ
//	|	И ЗаказИМШтрихкодыУпаковокВозврат.Ссылка is null
//	|";
//	Запр.УстановитьПараметр("ШКУ", ШКУ); 
//	Запр.УстановитьПараметр("ЗИМСсыл", ЗИМСсыл);
//	Выб =Запр.Выполнить().Выбрать();
//	Если Выб.Следующий() Тогда
//		Рез = Выб.Номер;
//	КонецЕсли;	
//	Возврат Рез;
//КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика 
	//Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
	//	Объект.Автор = ПараметрыСеанса.Пользователь;
	//КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Объект.Статус) Тогда
	//	Объект.Статус = Перечисления.СтатусЗаказаИМ.Формирование;
	//КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
	//	Объект.Подразделение = ОбщегоНазначения_ПИ.ПодразделениеТекущегоУзла();
	//КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
	//	Объект.Склад = Объект.Подразделение.СкладПоУмолчанию;
	//КонецЕсли; 
	//Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	//	Объект.Организация = Объект.Подразделение.Организация;
	//КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
	//	Объект.Контрагент = Константы.ПокупательИМ.Получить();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере(); 
	УстВидим();
	ПоказатьКолво();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКолво()
	Объект.СуммаЗаказа = (Объект.Товары.Итог("Всего")); 
	Объект.СуммаЗаказаОбщая = (Объект.Товары.Итог("ВсегоЗаказ"));
	Элементы.СтраницаТовары.Заголовок = "Товары" + ?(Объект.Товары.Итог("Заказ")," (" + Формат(Объект.Товары.Итог("Заказ"), "ЧДЦ=0; ЧН=-; ЧГ=3,0") + ")", "");
	Элементы.СтраницаШК.Заголовок = "ШК упаковок" + ?(Объект.ШтрихкодыУпаковок.Количество(), " (" + Формат(Объект.ШтрихкодыУпаковок.Количество(), "ЧДЦ=0; ЧН=-; ЧГ=3,0") + ")", ""); 
	//ШК упаковок возврат СтраницаШКВозврат
	Элементы.СтраницаШКВозврат.Заголовок = "ШК упаковок вычерк" + ?(Объект.ШтрихкодыУпаковокВозврат.Количество(), " (" + Формат(Объект.ШтрихкодыУпаковокВозврат.Количество(), "ЧДЦ=0; ЧН=-; ЧГ=3,0") + ")", "");
	Элементы.СтраницаВозвраты.Заголовок = ЗаголовокВозвраты();
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Формирование") Тогда
		СтатКоммент = "В этом статусе
		|формируется товары в заказе
		|заводятся данные по заказу
		|№ интернет заказа и т. п.";
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПодготовкаКВыдаче") Тогда
		СтатКоммент = "В этом статусе
		|сканируются КМ, производится подготовка
		|к передаче в доставку";
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ГотовоКВыдаче") Тогда
		СтатКоммент = "В этом статусе 
		|заказ готов к передаче в доставку";	
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПереданоВДоставку") Тогда
		СтатКоммент = "Это статус ожидания
		//|сканируются КМ
		//|производится подготовка к передаче в доставку
		|результатов доставки";	
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Обработка") Тогда
		СтатКоммент = "В этом статусе
		|сканируются КМ вычерков
		|клиента";
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.СформированыДокументы") Тогда
		СтатКоммент = "В этом статусе 
		|можно только создавать возвраты";
		//|клиента";
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ОтказКлиента") Тогда
		СтатКоммент = "Этот статус присваивается при полном отказе 
		//|сканируются КМ
		//|производится подготовка к передаче в доставку
		|при полном отказе клиента от приобретения";
	Иначе
		СтатКоммент = "Этот статус  
		//|сканируются КМ
		//|производится подготовка к передаче в доставку
		|требует уточнения";	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ЗаголовокВозвраты() 
	Рез =  "Возвраты " + ?(Объект.Возвраты.Количество(), " (док-тов: " + Формат(Объект.Возвраты.Количество(), "ЧДЦ=0; ЧН=-; ЧГ=3,0") + ")", "");
	Поз = 0;
	Для Каждого ТСтр Из Объект.Возвраты Цикл
		Поз = Поз + ТСтр.Возврат.ШтрихкодыУпаковок.Количество();
	КонецЦикла;
	Рез = Рез + ?(Поз, " (позиций: " + Формат(Поз, "ЧДЦ=0; ЧН=-; ЧГ=3,0") + ")", "");
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура УстВидим()
	//Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Формирование") Тогда
	//	Элементы.Группа9.Доступность = Истина;
	//Иначе
	//	Элементы.Группа9.Доступность = Ложь;
	//КонецЕсли;  
	//Элементы.ФормаПеревестиВСканированиеКМ.Видимость = ?(Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Формирование"), Истина, Ложь);

	//Элементы.ФормаПодготовитьКПередачеВДоставку.Видимость = ?(Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПодготовкаКВыдаче"), Истина, Ложь);
	//Элементы.ФормаПередатьВДоставку.Видимость = ?(Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ГотовоКВыдаче"), Истина, Ложь);
	//Элементы.ФормаОбработатьИзДоставки.Видимость = ?(Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПереданоВДоставку"), Истина, Ложь);
	//Элементы.ФормаСоздатьДокументы.Видимость = ?(Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Обработка"), Истина, Ложь);
	//Элементы.ФормаОформитОтказКлиента.Видимость = ?(Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Обработка"), Истина, Ложь);
	//Элементы.ФормаСформироватьВозврат.Видимость = ?(Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.СформированыДокументы") ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПодтвержденаОплата"), Истина, Ложь);
	//Элементы.ФормаНазад.Видимость =?(НЕ (Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.СформированыДокументы") ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ОтказКлиента")
	//ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПодтвержденаОплата")), Истина, Ложь);
КонецПроцедуры	

//&НаСервере
//Функция НайтиПоКодуХТНаСервере()
//	// Вставить содержимое обработчика. 
//	Запр = Новый Запрос;
//	Рез = Новый Структура("НН, НС, Ном, ХарНом, Ед, Ост, СтНДС", Истина, 0, Неопределено, Новый Массив, Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796"), 0, Неопределено);
//	ХТ = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду(КодТовараИзЗаказа);
//	Если ЗначениеЗаполнено(ХТ) Тогда
//		Рез.НН = Ложь; 
//		Рез.ХарНом.Добавить(ХТ);
//		Рез.Ном = ХТ.Владелец;
//		Рез.СтНДС = Рез.Ном.СтавкаНДС;
//		НайдыТ = Объект.Товары.НайтиСтроки(Новый Структура("ХарактеристикаНоменклатуры", ХТ));
//		Если НайдыТ.Количество() Тогда
//			Рез.НС = НайдыТ[0].НомерСтроки;
//		Иначе	
//		
//		КонецЕсли;
//		Возврат Рез;
//	КонецЕсли;
//	
//	Ном = Справочники.Номенклатура.НайтиПоКоду(КодТовараИзЗаказа);
//	Если ЗначениеЗаполнено(Ном) Тогда
//		
//		Рез.НН = Ложь; 
//		Рез.Ном = Ном;
//		Рез.СтНДС = Рез.Ном.СтавкаНДС;
//		Запр.Текст =
//		"ВЫБРАТЬ
//		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
//		|ИЗ
//		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
//		|ГДЕ
//		|	ХарактеристикиНоменклатуры.Владелец = &Ном";
//		Запр.УстановитьПараметр("Ном", Ном);
//		Выб = Запр.Выполнить().Выбрать();
//		Пока Выб.Следующий() Цикл
//			ТХТ = Выб.Ссылка;
//			НайдыТ = Объект.Товары.НайтиСтроки(Новый Структура("ХарактеристикаНоменклатуры", ТХТ));
//			Если НайдыТ.Количество() = 0 Тогда
//				//Рез.НС = НайдыТ[0].НомерСтроки;
//				//Иначе	
//				Рез.ХарНом.Добавить(ТХТ);
//			КонецЕсли;
//		КонецЦикла;
//		Возврат Рез;
//	КонецЕсли;
//	
//	Возврат Рез;
//КонецФункции

&НаКлиенте
Процедура НайтиПоКодуХТ(Команда)
	//Если НЕ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Формирование") Тогда
	//	ПоказатьПредупреждение(, "Товарная часть подбирается только в статусе Формирование");
	//	Возврат;
	//КонецЕсли;	
	//ВС = НайтиПоКодуХТНаСервере();
	//Если ВС.НН Тогда
	//	ПоказатьПредупреждение(, "Товар не найден");
	//Иначе	
	//	Если ВС.НС = 0 Тогда
	//		НовСтр = Объект.Товары.Добавить();
	//		НовСтр.Номенклатура = ВС.Ном; 
	//		НовСтр.Единица = ВС.Ед;
	//		НовСтр.СтавкаНДС = ВС.СтНДС;
	//		НовСтр.ХарактеристикаНоменклатуры = ВС.ХарНом[0];
	//		Если ВС.ХарНом.Количество() > 1 Тогда
	//			Элементы.ТоварыХарактеристикаНоменклатуры.СписокВыбора.Очистить();
	//			Для Каждого ТЭл Из ВС.ХарНом Цикл
	//				Элементы.ТоварыХарактеристикаНоменклатуры.СписокВыбора.Добавить(ТЭл);
	//				
	//			КонецЦикла;	
	//			Элементы.ТоварыХарактеристикаНоменклатуры.РежимВыбораИзСписка = Истина;
	//		КонецЕсли;	
	//		//НовСтр.КоличествоОстаток = ВС.Ост;
	//		НовСтр.Коэффициент = 1; 
	//		
	//		НовСтр.Заказ = 1;
	//		УстановитьЦенуСкидкуВСтрокеТЧ(НовСтр);
	//	Иначе
	//		ПоказатьПредупреждение(, "Товар уже внесен в заказ, строка № " + Строка(ВС.НС));
	//	КонецЕсли;
	//КонецЕсли; 
	ПоказатьКолво();
КонецПроцедуры

//&НаСервере
//Функция ПолучитьЦену(Номенклатура, ХарактеристикаНоменклатуры)
//	Запр = Новый Запрос;
//	Запр.Текст ="ВЫБРАТЬ
//	            |	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
//	            |	ЦеныНоменклатуры.Цена КАК Цена,
//	            |	ЦеныНоменклатуры.ХарактеристикаНоменклатуры КАК ХарНом,
//	            |	ЦеныНоменклатуры.ПрайсЛист.Дата КАК ПрайсЛистДата
//	            |ИЗ
//	            |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
//	            |ГДЕ
//	            |	(ЦеныНоменклатуры.ПрайсЛист.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
//	            |			ИЛИ ЦеныНоменклатуры.ПрайсЛист.Подразделение = &Подразделение)
//	            |	И ЦеныНоменклатуры.ПрайсЛист.ДействителенПо >= &ТекДата
//	            |	И ЦеныНоменклатуры.ПрайсЛист.ТипЦен = &ТипЦен
//	            |	И ЦеныНоменклатуры.Номенклатура = &Номенклатура
//	            |
//	            |УПОРЯДОЧИТЬ ПО
//	            |	ПрайсЛистДата УБЫВ";
//	Запр.УстановитьПараметр("ТипЦен", Объект.Подразделение.ТипЦен);
//	Запр.УстановитьПараметр("Подразделение", Объект.Подразделение); 
//	Запр.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса()); 
//	Запр.УстановитьПараметр("Номенклатура", Номенклатура);
//	Выб = Запр.Выполнить().Выбрать();
//	Если Выб.Следующий() Тогда
//		Возврат Выб.Цена;
//	Иначе	
//		Возврат 0; 
//	КонецЕсли;	
//	//РегистрыСведений.ЦеныНоменклатуры.ПолучитьЦену(Номенклатура, ХарактеристикаНоменклатуры, ТипыЦен, Подразделение, Период);
//КонецФункции

//// обертка для вызова функции модуля менеджера
//&НаСервере
//Функция ПолучитьСкидку(Номенклатура, ХарактеристикаНоменклатуры)
//	//Возврат РегистрыСведений.СкидкиНоменклатуры.ПолучитьСкидку(Номенклатура, ХарактеристикаНоменклатуры, ТипСкидок, Подразделение, Период);
//	Запр = Новый Запрос;
//	Запр.Текст ="ВЫБРАТЬ
//	            |	СкидкиНоменклатуры.Номенклатура КАК Номенклатура,
//	            |	СкидкиНоменклатуры.Скидка КАК Скидка,
//	            |	СкидкиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарНом,
//	            |	СкидкиНоменклатуры.ДокументУстановкаСкидок.Дата КАК ДатаСк
//	            |ИЗ
//	            |	РегистрСведений.СкидкиНоменклатуры КАК СкидкиНоменклатуры
//	            |ГДЕ
//	            |	(СкидкиНоменклатуры.ДокументУстановкаСкидок.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
//	            |			ИЛИ СкидкиНоменклатуры.ДокументУстановкаСкидок.Подразделение = &Подразделение)
//	            |	И СкидкиНоменклатуры.ДокументУстановкаСкидок.ДействителенПо >= &ТекДата
//	            |	И СкидкиНоменклатуры.ДокументУстановкаСкидок.ТипСкидок = &ТипСк
//	            |	И СкидкиНоменклатуры.Номенклатура = &Номенклатура
//	            |
//	            |УПОРЯДОЧИТЬ ПО
//	            |	ДатаСк УБЫВ";
//	Запр.УстановитьПараметр("ТипСк", Объект.Подразделение.ТипСкидок);
//	Запр.УстановитьПараметр("Подразделение", Объект.Подразделение); 
//	Запр.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса()); 
//	Запр.УстановитьПараметр("Номенклатура", Номенклатура);
//	Выб = Запр.Выполнить().Выбрать();
//	Если Выб.Следующий() Тогда
//		Возврат Выб.Скидка;
//	Иначе	
//		Возврат 0; 
//	КонецЕсли;
//КонецФункции

//&НаКлиенте
//Процедура УстановитьЦенуСкидкуВСтрокеТЧ(СтрокаТЧ)
//	// для получения цены берем текущую дату, а не начало дня
//	////ДанныеПоЦене = ПолучитьЦену(СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры, ПолучитьТипыЦен(), Объект.Подразделение, Объект.Дата);
//	//ДанныеПоЦене = ПолучитьЦену(СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры, ПолучитьТипыЦен(), Объект.Подразделение, ТекущаяДата()); 
//	//ДанныеПоЦене = ПолучитьЦену(СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры, ПолучитьТипыЦен(), ПолучитьПП(), ТекущаяДата());
//	СтрокаТЧ.ЦенаБезСкидки	= ПолучитьЦену(СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры);
//	//ОбщаяСкидка		= Объект.Скидка;
//	//Если ОбщаяСкидка = 0 И ОбращатьсяКРегистру Тогда
//	//	ОбщаяСкидка	= ПолучитьСкидку(СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры, Объект.ТипСкидок, Объект.Подразделение, ТекущаяДата());
//	//КонецЕсли;
//	//СтрокаТЧ.Скидка	= ПолучитьСкидку(СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры, ПолучитьТипыСкид(), Объект.Подразделение, ТекущаяДата()); 
//	СтрокаТЧ.Скидка	= ПолучитьСкидку(СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры);
//	СтрокаТЧ.Цена	= СтрокаТЧ.ЦенаБезСкидки * (1 - Окр(СтрокаТЧ.Скидка/100, 2));
//	//СтрокаТЧ.ТипЦен			= ДанныеПоЦене.ТипЦен;
//	//СтрокаТЧ.Распродажа		= (СтрокаТЧ.ТипЦен = Объект.ТипЦенРаспродажа);
//КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПоказатьКолво();
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	// Вставить содержимое обработчика.
	//Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Формирование") Тогда
	//	Если Объект.Товары.Количество() = 0 Тогда
	//		ПоказатьПредупреждение(, "Товарная часть интернет заказа не сформирована!");
	//		Возврат;
	//	КонецЕсли;
	//	ЕстьПустыеЦены = Ложь;
	//	Для Каждого ТСтр Из Объект.Товары Цикл
	//		Если НЕ ЗначениеЗаполнено(ТСтр.Цена) Тогда
	//			ЕстьПустыеЦены = Истина;
	//			Прервать;
	//		КонецЕсли;	
	//	КонецЦикла;
	//	Если ЕстьПустыеЦены Тогда
	//		ПоказатьПредупреждение(, "Не все цены интернет заказа заполнены!");
	//		Возврат;
	//	КонецЕсли;
	//	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПодготовкаКВыдаче");
	//ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПодготовкаКВыдаче") Тогда
	//	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ГотовоКВыдаче"); 
	//ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ГотовоКВыдаче") Тогда
	//	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПереданоВДоставку");
	//	Объект.ДатаОтгрузки = ТекущаяДата();
	//ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПереданоВДоставку") Тогда
	//	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Обработка");	
	//ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Обработка") Тогда
	//	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.СформированыДокументы"); 
	//	Объект.ДатаАвизации = ТекущаяДата();
	//ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.СформированыДокументы") Тогда
	////	СтатКоммент = "В этом статусе
	////	|формируются документы
	////	|покупки и возврата(если есть)";
	////	//|клиента";
	////ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ОтказКлиента") Тогда
	////	СтатКоммент = "Этот статус присваивается при полном отказе 
	////	//|сканируются КМ
	////	//|производится подготовка к передаче в доставку
	////	|при полном отказе клиента от приобретения";
	////Иначе
	////	СтатКоммент = "Этот статус  
	////	//|сканируются КМ
	////	//|производится подготовка к передаче в доставку
	////	|требует уточнения";	
	//КонецЕсли;
	//ПоказатьКолво();
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	// Вставить содержимое обработчика. 
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Формирование") Тогда
		//Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПринятоКВыдаче");
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПодготовкаКВыдаче") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Формирование"); 
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ГотовоКВыдаче") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПодготовкаКВыдаче");	
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПереданоВДоставку") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ГотовоКВыдаче");	
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Обработка") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПереданоВДоставку");
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.СформированыДокументы") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Обработка");
	//	СтатКоммент = "В этом статусе
	//	|формируются документы
	//	|покупки и возврата(если есть)";
	//	//|клиента";
	//ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ОтказКлиента") Тогда
	//	СтатКоммент = "Этот статус присваивается при полном отказе 
	//	//|сканируются КМ
	//	//|производится подготовка к передаче в доставку
	//	|при полном отказе клиента от приобретения";
	//Иначе
	//	СтатКоммент = "Этот статус  
	//	//|сканируются КМ
	//	//|производится подготовка к передаче в доставку
	//	|требует уточнения";	
	КонецЕсли;
	ПоказатьКолво();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТоварыПриИзмененииНаСервере(Элементы.Товары.ТекущаяСтрока);
	ПоказатьКолво();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТоварыПриИзмененииНаСервере(Элементы.Товары.ТекущаяСтрока);
	
	ПоказатьКолво();
КонецПроцедуры 

&НаСервере
Процедура ТоварыПриИзмененииНаСервере(ТСтрока)
	// Вставить содержимое обработчика.
	ТСтрока = ?(ТСтрока = Неопределено, 0, ТСтрока);
	НайдТ = Объект.Товары.НайтиПоИдентификатору(ТСтрока);
	//СтрБр.УИД = "";
	//Если ЗначениеЗаполнено(СтрБр.Брэнд) Тогда
	//	СтрБр.УИД = СокрЛП(СтрБр.Брэнд.УникальныйИдентификатор());
	//КонецЕсли;
	НайдТ.ВсегоЗаказ = НайдТ.Цена * НайдТ.Заказ;
	НайдТ.Всего = НайдТ.Цена * НайдТ.ПодтвержденныйЗаказ;
	ПроцНДС = Перечисления.СтавкиНДС.ПроцентНДС(НайдТ.СтавкаНДС);
	Всего = НайдТ.Всего;
	НайдТ.НДС = Окр(ПроцНДС * Всего/(100 + ПроцНДС), 2);
	НайдТ.Сумма	= Всего - НайдТ.НДС;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВозврат(Команда)
	// Вставить содержимое обработчика. 
	//ПараметрыФормы.Вставить("ВозможностьОплатыСБП",	ПодключенСБП());  
	ОповещениеСозданВозврат = Новый ОписаниеОповещения("СозданВозврат", ЭтаФорма);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаказИМ",	Объект.Ссылка);
	ОткрытьФорму("Документ.ЗаказИМ.Форма.ФормаСозданияВозврата", ПараметрыФормы,,,,, ОповещениеСозданВозврат, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура СозданВозврат(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	// если закрыли форму крестиком
	Если РезультатЗакрытия = Неопределено Тогда
		//РезультатЗакрытия = Новый Структура;
		//РезультатЗакрытия.Вставить("ОтправлятьЭлектронно", Ложь);
	Иначе
		НВ = Объект.Возвраты.Добавить();
		НВ.Возврат = РезультатЗакрытия.ДокВозврат;
	КонецЕсли;
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	ЭтаФорма.ОбновитьОтображениеДанных(); 
	ПоказатьКолво();
	УстВидим();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьКПередачеВДоставку(Команда)
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ГотовоКВыдаче");
	
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	ПоказатьКолво();
	УстВидим();	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВДоставку(Команда)
	// Вставить содержимое обработчика.
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПереданоВДоставку");
	Объект.ДатаОтгрузки = ТекущаяДата(); 
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	ЭтаФорма.ОбновитьОтображениеДанных();
	ПоказатьКолво();
	УстВидим();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзДоставки(Команда)
	// Вставить содержимое обработчика.
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.Обработка");
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	ЭтаФорма.ОбновитьОтображениеДанных();
	ПоказатьКолво();
	УстВидим();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	// Вставить содержимое обработчика.
	Если СоздатьДокументыСрв() Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.СформированыДокументы");
	КонецЕсли;
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	ЭтаФорма.ОбновитьОтображениеДанных();
	ПоказатьКолво();
	УстВидим();
КонецПроцедуры

&НаСервере
Функция СоздатьДокументыСрв()
	Рез = Ложь;
	//Если Объект.Товары.Итог("Количество") = 0 Тогда
	//	Возврат Рез;
	//КонецЕсли;
	//
	//Вкп = Документы.ВыкупИМ.СоздатьДокумент();
	////ЗаполнитьЗначенияСвойств(Чек, ЧекПрод);	
	//Вкп.ДокОснование =  Объект.Ссылка;  
	//Объект.ДатаАвизации = ТекущаяДатаСеанса();
	//Вкп.Дата = ТекущаяДатаСеанса();
	//Вкп.Автор					= Пользователи.ТекущийПользователь();
	//Вкп.Организация = Объект.Организация;
	//Вкп.Подразделение = Объект.Подразделение;
	//Вкп.Склад = Объект.Склад;
	//Вкп.АдресДоставки = Объект.АдресДоставки;
	//Вкп.НомерИнетЗаказа = Объект.НомерИнетЗаказа;
	//Вкп.НомерЛогистЗаказа = Объект.НомерЛогистЗаказа;
	//Вкп.ДатаОтгрузки = Объект.ДатаОтгрузки;
	//Вкп.Контрагент = Объект.Контрагент;
	//Вкп.ДатаАвизации = Объект.ДатаАвизации;
	//Вкп.УстановитьНовыйНомер(ПланыОбмена.ОбменСТЦ.ЭтотУзел().Код + "-");
	////Чек.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
	//Для Каждого ТекСтрокаТовары Из Объект.Товары Цикл
	//	Если ТекСтрокаТовары.Количество Тогда
	//	//Если ТекСтрокаТовары.КоличествоВЧек > 0 Тогда
	//		//НайдыНом = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ТекПоз.Номенклатура, ТекПоз.ХарактеристикаНоменклатуры)); 
	//		//ТекСтрокаТовары = НайдыНом[0];
	//		ТекСтр = Вкп.Товары.Добавить();
	//		ТекСтр.Единица = ТекСтрокаТовары.Единица;
	//		ТекСтр.Количество = ТекСтрокаТовары.Количество;
	//		//ТекСтр.КоличествоПодтвержденное = ТекСтрокаТовары.Количество;
	//		ТекСтр.Коэффициент = ТекСтрокаТовары.Коэффициент;
	//		ТекСтр.Номенклатура = ТекСтрокаТовары.Номенклатура;
	//		ТекСтр.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
	//		
	//		ТекСтр.Цена = ТекСтрокаТовары.Цена;
	//		ТекСтр.ЦенаБезСкидки = ТекСтрокаТовары.ЦенаБезСкидки;
	//		//ТекСтр.Скидка = ТекСтрокаТовары.Скидка;
	//		//ТекСтр.НДС = ТекСтрокаТовары.НДС;
	//		ТекСтр.Всего = ТекСтр.Цена * ТекСтр.Количество;
	//		//ТекСтр.ВсегоОФД = ТекСтр.Цена * ТекСтр.Количество; 
	//		//ТекСтр.СуммаСкидки = (ТекСтр.ЦенаБезСкидки * ТекСтр.Количество) - ТекСтр.ВсегоОФД; 
	//		//ТекСтр.Менеджер = РСПСсылка.ПродавецДляЧека;
	//		//ТекСтр.Менеджер = ТекСтрокаТовары.Менеджер;
	//		//ТекСтр.СкидкаМаксма = ТекСтрокаТовары.СкидкаМаксма * (ТекСтр.Количество/ТекСтрокаТовары.Количество);
	//		//ТекСтр.УчтенаСкидкаМаксма = ТекСтрокаТовары.УчтенаСкидкаМаксма;
	//		ТекСтр.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС; 
	//		
	//		ПроцНДС = Перечисления.СтавкиНДС.ПроцентНДС(ТекСтр.СтавкаНДС);
	//		Всего = ТекСтр.Всего;
	//		ТекСтр.НДС = Окр(ПроцНДС * Всего/(100 + ПроцНДС), 2);
	//		ТекСтр.Сумма	= Всего - ТекСтр.НДС;
	//	КонецЕсли;
	//КонецЦикла;

	////Чек.СистемаНалогообложения = Справочники.Организации.ПолучитьСистемуНалогообложения(Чек.Дата, Чек.Организация);
	////Чек.Комментарий = "Док. основание " + СокрЛП(РСПСсылка) + ", клиент " + СокрЛП(РСПСсылка.Контрагент);
	//
	//
	//Вкп.СуммаДокумента			= Вкп.Товары.Итог("Всего");
	////ЭтотОбъект.СуммаОплатыСертификатами	= ЭтотОбъект.ОплатаПодарочнымиСертификатами.Итог("СуммаОплатыСертификатами");
	////Вкп.КоличествоДокумента		= Вкп.Товары.Итог("Количество");

	//Для Каждого ТекПоз Из Объект.ШтрихкодыУпаковок Цикл
	//	
	//	НайдыВ = Объект.ШтрихкодыУпаковокВозврат.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", ТекПоз.ШтрихкодУпаковки));
	//	Если НайдыВ.Количество() = 0 Тогда
	//		
	//		НовСтр = Вкп.ШтрихкодыУпаковок.Добавить();
	//		НовСтр.Номенклатура = ТекПоз.Номенклатура;
	//		НовСтр.ХарактеристикаНоменклатуры = ТекПоз.ХарактеристикаНоменклатуры;
	//		НовСтр.ШтрихкодУпаковки = ТекПоз.ШтрихкодУпаковки;
	//		//НовСтр.ШтрихкодУпаковкиТовара = ТекПоз.КМ;
	//		//НовСтр.Тэг_1265 =  ТекПоз.Тэг_1265;
	//		//НовСтр.ОтветРазрешительногоРежима =  ТекСтрокаШК.ОтветРазрешительногоРежима;
	//	КонецЕсли;
	//КонецЦикла; 
	//
	//Вкп.Записать(РежимЗаписиДокумента.Проведение);
	//
	//Объект.Выкуп = Вкп.Ссылка; 
	//Объект.СуммаВыкупа = Объект.Выкуп.СуммаДокумента;
	//Рез = Истина;
	//Если Объект.Товары.Итог("КоличествоВозврат") = 0 Тогда
	//	Возврат Рез;
	//КонецЕсли;
	//Взв = Документы.ВозвратИМ.СоздатьДокумент();
	////ЗаполнитьЗначенияСвойств(Чек, ЧекПрод);	
	//Взв.ДокОснование =  Объект.Ссылка;
	//Взв.Дата = ТекущаяДатаСеанса();
	//Взв.Автор					= Пользователи.ТекущийПользователь();
	//Взв.Организация = Объект.Организация;
	//Взв.Подразделение = Объект.Подразделение;
	//Взв.Склад = Объект.Склад;
	//Взв.АдресДоставки = Объект.АдресДоставки;
	//Взв.ДатаАвизации = Объект.ДатаАвизации;
	//Взв.НомерИнетЗаказа = Объект.НомерИнетЗаказа;
	//Взв.НомерЛогистЗаказа = Объект.НомерЛогистЗаказа;
	//Взв.Контрагент = Объект.Контрагент;
	//Взв.УстановитьНовыйНомер(ПланыОбмена.ОбменСТЦ.ЭтотУзел().Код + "-");
	////Чек.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
	//Для Каждого ТекСтрокаТовары Из Объект.Товары Цикл
	//	Если ТекСтрокаТовары.КоличествоВозврат Тогда
	//	//Если ТекСтрокаТовары.КоличествоВЧек > 0 Тогда
	//		//НайдыНом = ЗаказИМ.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ТекПоз.Номенклатура, ТекПоз.ХарактеристикаНоменклатуры)); 
	//		//ТекСтрокаТовары = НайдыНом[0];
	//		ТекСтр = Взв.Товары.Добавить();
	//		ТекСтр.Единица = ТекСтрокаТовары.Единица;
	//		ТекСтр.Количество = ТекСтрокаТовары.КоличествоВозврат;
	//		//ТекСтр.КоличествоПодтвержденное = ТекСтрокаТовары.Количество;
	//		ТекСтр.Коэффициент = ТекСтрокаТовары.Коэффициент;
	//		ТекСтр.Номенклатура = ТекСтрокаТовары.Номенклатура;
	//		ТекСтр.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
	//		
	//		ТекСтр.Цена = ТекСтрокаТовары.Цена;
	//		ТекСтр.ЦенаБезСкидки = ТекСтрокаТовары.ЦенаБезСкидки;
	//		//ТекСтр.Скидка = ТекСтрокаТовары.Скидка;
	//		//ТекСтр.НДС = ТекСтрокаТовары.НДС;
	//		ТекСтр.Всего = ТекСтр.Цена * ТекСтр.Количество;
	//		//ТекСтр.ВсегоОФД = ТекСтр.Цена * ТекСтр.Количество; 
	//		//ТекСтр.СуммаСкидки = (ТекСтр.ЦенаБезСкидки * ТекСтр.Количество) - ТекСтр.ВсегоОФД; 
	//		//ТекСтр.Менеджер = РСПСсылка.ПродавецДляЧека;
	//		//ТекСтр.Менеджер = ТекСтрокаТовары.Менеджер;
	//		//ТекСтр.СкидкаМаксма = ТекСтрокаТовары.СкидкаМаксма * (ТекСтр.Количество/ТекСтрокаТовары.Количество);
	//		//ТекСтр.УчтенаСкидкаМаксма = ТекСтрокаТовары.УчтенаСкидкаМаксма;
	//		ТекСтр.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС; 
	//		
	//		ПроцНДС = Перечисления.СтавкиНДС.ПроцентНДС(ТекСтр.СтавкаНДС);
	//		Всего = ТекСтр.Всего;
	//		ТекСтр.НДС = Окр(ПроцНДС * Всего/(100 + ПроцНДС), 2);
	//		ТекСтр.Сумма	= Всего - ТекСтр.НДС;
	//	КонецЕсли;
	//КонецЦикла;

	////Чек.СистемаНалогообложения = Справочники.Организации.ПолучитьСистемуНалогообложения(Чек.Дата, Чек.Организация);
	////Чек.Комментарий = "Док. основание " + СокрЛП(РСПСсылка) + ", клиент " + СокрЛП(РСПСсылка.Контрагент);
	//
	//
	//Взв.СуммаДокумента			= Взв.Товары.Итог("Всего");
	////ЭтотОбъект.СуммаОплатыСертификатами	= ЭтотОбъект.ОплатаПодарочнымиСертификатами.Итог("СуммаОплатыСертификатами");
	////Взв.КоличествоДокумента		= Взв.Товары.Итог("Количество");

	//Для Каждого ТекПоз Из Объект.ШтрихкодыУпаковокВозврат Цикл
	//	НовСтр = Взв.ШтрихкодыУпаковок.Добавить();
	//	НовСтр.Номенклатура = ТекПоз.Номенклатура;
	//	НовСтр.ХарактеристикаНоменклатуры = ТекПоз.ХарактеристикаНоменклатуры;
	//	НовСтр.ШтрихкодУпаковки = ТекПоз.ШтрихкодУпаковки;
	//КонецЦикла; 
	//
	//Взв.Записать(РежимЗаписиДокумента.Проведение); 
	//Объект.Возврат = Взв.Ссылка;
	//Объект.СуммаВозврата = Объект.Возврат.СуммаДокумента;
	Возврат Рез;
	
КонецФункции	

&НаКлиенте
Процедура ОформитОтказКлиента(Команда)
	// Вставить содержимое обработчика.  
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ОтказКлиента"); 
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	ЭтаФорма.ОбновитьОтображениеДанных();
	ПоказатьКолво();
	УстВидим();
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВСканированиеКМ(Команда)
	// Вставить содержимое обработчика.
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусЗаказаИМ.ПодготовкаКВыдаче");
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	ЭтаФорма.ОбновитьОтображениеДанных();
	ПоказатьКолво();
	УстВидим();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	// Вставить содержимое обработчика. 
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	Если НЕ СтрокаТЧ = Неопределено Тогда
		СтрокаТЧ.Цена	= СтрокаТЧ.ЦенаБезСкидки * (1 - Окр(СтрокаТЧ.Скидка/100, 2));
	КонецЕсли;	
КонецПроцедуры
